---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.FailureDefinition
source: html/a8f5e19f-8d64-bdf6-55fa-f286296b1532.htm
---
# FailureDefinition Members

Adds a type of possible resolution for the failure.